{"class_name": "Model", "config": {"name": "TucanaV5.4", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 6], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "recombine1", "class_name": "Conv1D", "config": {"name": "recombine1", "trainable": true, "filters": 29, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv1D", "config": {"name": "conv1", "trainable": true, "filters": 29, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "data2", "class_name": "Concatenate", "config": {"name": "data2", "trainable": true, "axis": -1}, "inbound_nodes": [[["input", 0, 0, {}], ["recombine1", 0, 0, {}], ["conv1", 0, 0, {}]]]}, {"name": "recombine2", "class_name": "Conv1D", "config": {"name": "recombine2", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["data2", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv1D", "config": {"name": "conv2", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["data2", 0, 0, {}]]]}, {"name": "data3", "class_name": "Concatenate", "config": {"name": "data3", "trainable": true, "axis": -1}, "inbound_nodes": [[["data2", 0, 0, {}], ["recombine2", 0, 0, {}], ["conv2", 0, 0, {}]]]}, {"name": "inception1_pool1", "class_name": "MaxPooling1D", "config": {"name": "inception1_pool1", "trainable": true, "strides": [1], "pool_size": [3], "padding": "same"}, "inbound_nodes": [[["data3", 0, 0, {}]]]}, {"name": "inception1_3x3_1", "class_name": "Conv1D", "config": {"name": "inception1_3x3_1", "trainable": true, "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["data3", 0, 0, {}]]]}, {"name": "inception1_5x5_1", "class_name": "Conv1D", "config": {"name": "inception1_5x5_1", "trainable": true, "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["data3", 0, 0, {}]]]}, {"name": "inception1_pool2", "class_name": "Conv1D", "config": {"name": "inception1_pool2", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception1_pool1", 0, 0, {}]]]}, {"name": "inception1_1x1", "class_name": "Conv1D", "config": {"name": "inception1_1x1", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["data3", 0, 0, {}]]]}, {"name": "inception1_3x3_2", "class_name": "Conv1D", "config": {"name": "inception1_3x3_2", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception1_3x3_1", 0, 0, {}]]]}, {"name": "inception1_5x5_2", "class_name": "Conv1D", "config": {"name": "inception1_5x5_2", "trainable": true, "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception1_5x5_1", 0, 0, {}]]]}, {"name": "inception1_result", "class_name": "Concatenate", "config": {"name": "inception1_result", "trainable": true, "axis": -1}, "inbound_nodes": [[["inception1_pool2", 0, 0, {}], ["inception1_1x1", 0, 0, {}], ["inception1_3x3_2", 0, 0, {}], ["inception1_5x5_2", 0, 0, {}]]]}, {"name": "inception2_pool1", "class_name": "MaxPooling1D", "config": {"name": "inception2_pool1", "trainable": true, "strides": [1], "pool_size": [3], "padding": "same"}, "inbound_nodes": [[["inception1_result", 0, 0, {}]]]}, {"name": "inception2_3x3_1", "class_name": "Conv1D", "config": {"name": "inception2_3x3_1", "trainable": true, "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception1_result", 0, 0, {}]]]}, {"name": "inception2_5x5_1", "class_name": "Conv1D", "config": {"name": "inception2_5x5_1", "trainable": true, "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception1_result", 0, 0, {}]]]}, {"name": "inception2_pool2", "class_name": "Conv1D", "config": {"name": "inception2_pool2", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception2_pool1", 0, 0, {}]]]}, {"name": "inception2_1x1", "class_name": "Conv1D", "config": {"name": "inception2_1x1", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception1_result", 0, 0, {}]]]}, {"name": "inception2_3x3_2", "class_name": "Conv1D", "config": {"name": "inception2_3x3_2", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception2_3x3_1", 0, 0, {}]]]}, {"name": "inception2_5x5_2", "class_name": "Conv1D", "config": {"name": "inception2_5x5_2", "trainable": true, "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception2_5x5_1", 0, 0, {}]]]}, {"name": "inception2_result", "class_name": "Concatenate", "config": {"name": "inception2_result", "trainable": true, "axis": -1}, "inbound_nodes": [[["inception2_pool2", 0, 0, {}], ["inception2_1x1", 0, 0, {}], ["inception2_3x3_2", 0, 0, {}], ["inception2_5x5_2", 0, 0, {}]]]}, {"name": "inception3_pool1", "class_name": "MaxPooling1D", "config": {"name": "inception3_pool1", "trainable": true, "strides": [1], "pool_size": [3], "padding": "same"}, "inbound_nodes": [[["inception2_result", 0, 0, {}]]]}, {"name": "inception3_3x3_1", "class_name": "Conv1D", "config": {"name": "inception3_3x3_1", "trainable": true, "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception2_result", 0, 0, {}]]]}, {"name": "inception3_5x5_1", "class_name": "Conv1D", "config": {"name": "inception3_5x5_1", "trainable": true, "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception2_result", 0, 0, {}]]]}, {"name": "inception3_pool2", "class_name": "Conv1D", "config": {"name": "inception3_pool2", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception3_pool1", 0, 0, {}]]]}, {"name": "inception3_1x1", "class_name": "Conv1D", "config": {"name": "inception3_1x1", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception2_result", 0, 0, {}]]]}, {"name": "inception3_3x3_2", "class_name": "Conv1D", "config": {"name": "inception3_3x3_2", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception3_3x3_1", 0, 0, {}]]]}, {"name": "inception3_5x5_2", "class_name": "Conv1D", "config": {"name": "inception3_5x5_2", "trainable": true, "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception3_5x5_1", 0, 0, {}]]]}, {"name": "inception3_result", "class_name": "Concatenate", "config": {"name": "inception3_result", "trainable": true, "axis": -1}, "inbound_nodes": [[["inception3_pool2", 0, 0, {}], ["inception3_1x1", 0, 0, {}], ["inception3_3x3_2", 0, 0, {}], ["inception3_5x5_2", 0, 0, {}]]]}, {"name": "reduce", "class_name": "Conv1D", "config": {"name": "reduce", "trainable": true, "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inception3_result", 0, 0, {}]]]}, {"name": "dropout1", "class_name": "Dropout", "config": {"name": "dropout1", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["reduce", 0, 0, {}]]]}, {"name": "final1", "class_name": "Conv1D", "config": {"name": "final1", "trainable": true, "filters": 24, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout1", 0, 0, {}]]]}, {"name": "dropout2", "class_name": "Dropout", "config": {"name": "dropout2", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["final1", 0, 0, {}]]]}, {"name": "final2", "class_name": "Conv1D", "config": {"name": "final2", "trainable": true, "filters": 16, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout2", 0, 0, {}]]]}, {"name": "final3", "class_name": "Conv1D", "config": {"name": "final3", "trainable": true, "filters": 1, "kernel_size": [1], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["final2", 0, 0, {}]]]}, {"name": "output", "class_name": "Reshape", "config": {"name": "output", "trainable": true, "target_shape": [256]}, "inbound_nodes": [[["final3", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.0.5", "backend": "tensorflow"}